/*
Πρόγραμμα Υπολογισμού δίσεκτου έτους.
Δημιουργία: Νίκος-Νικήτας
*/


#include <stdio.h> //Η βιβλιοθήκη για βασικές λειτουργίες της C όπως είσοδο/έξοδο.
#include <stdlib.h>
#include <locale.h> //Προαιρετικά μια βιβλιοθήκη για να αναγνωρίζονται τα ελληνικά γράμματα από το σύστημά μας.

int main(){
  setlocale(LC_ALL,""); // Μέθοδος για να αναγνωρίζονται τα ελληνικά

/*
    Εναλλακτικά χρησιμοποιείται και η μέθοδο system("chcp 28597" ή "chcp 1253");
    που είναι άλλος ένας τρόπος για αναγνώριση των ελληνικών χαρακτήρων από το πρόγραμμα,
    όμως εμένα μου εμφάνιζε την προειδοποίηση
    "|5|warning: implicit declaration of function 'system' [-Wimplicit-function-declaration]|"
    και προτίμησα τον άλλον τρόπο ως ασφαλέστερο.
*/

// Η μέθοδος printf(); τυπώνει τον τίτλο και τις πληροφορίες της εφαρμογής.

	printf("*****************************************\n");

	printf("*** ΥΠΟΛΟΓΙΣΜΟΣ ΔΙΣΕΚΤΟΥ ΕΤΟΥΣ ΣΤΗΝ C ***\n");

    printf("*****************************************\n");

    printf("ΔΗΜΙΟΥΡΓΙΑ ΚΑΙ ΑΝΑΠΤΥΞΗ ΕΦΑΡΜΟΓΗΣ\nΝΙΚΟΣ-ΝΙΚΗΤΑΣ\n\n\n\n");

/* Δέχεται δυο μεταβλητές το έτος (year) που θα υπολογίσει
    και τη μεταβλητή (loopNum) με την οποία επαναλαμβάνουμε τη διαδικασία υπολογισμού
    εφόσον ο χρήστης το επιθυμεί. Εάν επιθυμεί ο χρήστης να βγει από το πρόγραμμα
    το κλείνει είτε από το Χ του παραθύρου είτε τερματίζει το πρόγραμμα πληκτρολογώντας
    έναν αριθμό εκτός του 1.
*/

    int year;
    int loopNum = 1;

while (loopNum == 1) {
    printf("ΕΙΣΑΓΕΤΕ ΤΟ ΕΤΟΣ: ");

    //Το πρόγραμμα δέχεται εισαγωγή του έτους από τον χρήστη.

    scanf("%d",&year);
    /*
    Εδώ ελέγχεται το έτος με βάση τον τύπο υπολογισμού δίσεκτου έτους
    και τυπώνεται το ανάλογο αποτέλεσμα
    */
    if (((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0)) {
        printf("\n\n");
        printf("ΤΟ ΕΤΟΣ ΕΙΝΑΙ ΔΙΣΕΚΤΟ.\n ");
    } else {
    printf("\n\n");
    printf("ΤΟ ΕΤΟΣ ΔΕΝ ΕΙΝΑΙ ΔΙΣΕΚΤΟ.\n");
    }
    printf("\n \n");
    printf("ΑΝ ΘΕΛΕΤΕ ΝΑ ΣΥΝΕΧΙΣΕΤΕ ΠΑΤΗΣΤΕ 1.\nΓΙΑ ΝΑ ΒΓΕΙΤΕ ΠΑΤΗΣΤΕ ΕΝΑΝ ΑΛΛΟΝ ΑΡΙΘΜΟ: ");
    scanf("%d",&loopNum);
}
    system("pause");
	return 0; //Επιστρέφει την τιμή 0 στο λειτουργικό σύστημα και τερματίζει το πρόγραμμα.
}
