/* 

Πρόγραμμα υπολογισμού μάζας σώματος.
Δημιουργία: Νίκος-Νικήτας

*/

#include <iostream> //Η βιβλιοθήκη εισόδου/εξόδου
#include <cstdlib>
#include <locale.h> 

//βιβλιοθήκες για να αναγνωρίζει τα ελληνικά

using namespace std; 

//για να μην χρησιμοποιούμε std::

int main() {

setlocale(LC_ALL,"");

/* κι εδώ δηλώνουμε πως θέλουμε τη γλώσσα του συστήματος
*/

float w;
float h;
float bms;

cout << "****************************************\n";
cout << "*** ΥΠΟΛΟΓΙΣΜΟΣ ΜΑΖΑΣ ΣΩΜΑΤΟΣ ΣΕ C++ ***\n";
cout << "****************************************\n";
cout << "ΔΗΜΙΟΥΡΓΙΑ ΚΑΙ ΑΝΑΠΤΥΞΗ ΕΦΑΡΜΟΓΗΣ:\nΝΙΚΟΣ-ΝΙΚΗΤΑΣ\n\n";

cout << "Πατήστε ένα πλήκτρο για να συνεχίσετε.\n";
cin.get();

cout << "Εισάγετε βάρος: " << "\n";
cin >> w;

cout << "Εισάγετε ύψος: " << "\n";
cin >> h;

bms = w/(h*h);

if (bms<=18.5) {
cout << "\n\n" << "ΑΔΥΝΑΤΟΣ";
}
else if ((bms>18.6)&&(bms<=25)) {
    cout << "\n\n" << "ΚΑΝΟΝΙΚΟ ΒΑΡΟΣ";
}
else if ((bms>25.1)&&(bms<=30)) {
    cout << "\n\n" << "ΒΑΡΥΣ";
}
else {
    cout << "\n\n" << "ΥΠΕΡΒΑΡΟΣ" ;
}
cout << "\n\n";
system("pause"); 
//κρατάει το παράθυρο ανοικτό με παύση

return 0;

}
/*

Δέχεται και δεκαδικούς από τον χρήστη 
και υπολογίζει τη μάζα σώματος
με βάση βάρος και ύψος αναλόγως την περίπτωση.

*/